adm/ifioppgaver23v.tex
% Created 2023-06-09 Fri 12:30
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Olaf Owe}
\date{\today}
\title{Oppgaver for IfI våren 2023}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 26.1 (Org mode 8.2.5h)}}
\begin{document}

\maketitle



\section{PhD veiledning}
\label{sec-1}
\begin{itemize}
\item Dette semesteret har  jeg jobbet med Farzane Karami,
som jeg er hovedveileder for. Hun har gjort  ferdig og levert sin
avhandling  (i mai):
\emph{Language-based Approaches for Enforcing Privacy and Security Policies}

\item Jeg har jobbet jevnlig med Chinmayi Baramashetru. Et invitert bok-kapittel
er sendt inn (med Chinmayi, Lizeth og meg som forfattere),
og en annen artikkel er under arbeid, og en tredje artikkel er påbegynt.

\item Jeg har jobbet videre med Hamed Arshad, som  disputerte  des. 2022,
om publisering av arbeider som direkte bygger på dr.arbeidet hans.
\end{itemize}
\subsection{Mentoring}
\label{sec-1-1}

\begin{itemize}
\item Jeg har fulgt opp flere PhD studenter i 4.,
8., 9. og 10. etg.
\end{itemize}

\begin{itemize}
\item Jeg har hjulpet flere  PhD kandidater med å finne jobb
etter PhD studiet.

\item Jeg er invitert med på en artikkel med en PhD student fra ND, der
jeg er bedt om å se på personvernsaspektet.
\end{itemize}
\subsection{PhD 3. semester evaluering for}
\label{sec-1-2}

\begin{itemize}
\item Paul Kobialka (PSY/ASR), 1. juni 2023
\item Poushali Sengupta (NR), 1. juni 2023
\end{itemize}
\section{Master veiledning}
\label{sec-2}
\begin{itemize}
\item Jeg har bidratt med veiledning av  master-studenter.
\item Jeg har vært ansvarlig for en Erasmus utvekslings-student.
\end{itemize}
\subsection{Master sensurering}
\label{sec-2-1}
\begin{itemize}
\item Jeg er sensor for Thalha Khan:
\emph{Machine Learning and Artificial Intelligence in Malware Detection},
(juni 2023).
\item Jeg er sensor for Sigbjørn Bjunes:
\emph{The Importance of Social Awareness In Norwegain Organisations} (juni 2023)
\end{itemize}
\section{Publikasjoner}
\label{sec-3}
\begin{itemize}
\item \emph{Integrating Data Privacy Compliance in Active Object Languages}.
Chinmayi Prabhu Baramashetru, S. Lizeth Tapia Tarifa, Olaf Owe.
Submitted as a chapter to a Spinger special issue on \emph{Active Object
Languages}  (May 2023).

\item \emph{XACML2mCRL2: Automatic Transformation of XACML Policies into mCRL2 Specifications}.
Hamed Arshad, Ross Horne, Christian Johansen, Olaf Owe, Tim
A. C. Willemse.   
Revision submitted to \textbf{Science of Computer  Programming} (May 2023).
\end{itemize}


\subsection{Under arbeid}
\label{sec-3-1}

\begin{itemize}
\item \emph{From Ping to Pong and Back Again}.

Frank S. de Boer (CWI), Einar Broch Johnsen, Olaf Owe,
Violet Ka I Pun  (HVL),  Silvia Lizeth Tapia Tarifa.

\item \emph{A Formal Model of Language-Based GDPR in Distributed Systems}. 
Chinmayi Prabhu Baramashetru, S. Lizeth Tapia Tarifa,
Olaf Owe.

\item \emph{An Interpreter for  Data Privacy Compliance in an Active Object
Language}. 
Chinmayi P. Baramashetru, S. Lizeth Tapia Tarifa,
Olaf Owe.
\end{itemize}

\subsection{Pris}
\label{sec-3-2}

Følgende tidsskrifts-artikkel er nominert for en best paper award:

Olaf Owe, Elahe Fazeldehkordi: A Lightweight Approach to Smart Contracts Supporting Safety, Security, and
Privacy.  Journal of Logical and Algebraic Methods in Programming (JLAMP) Vol. 127, 100772, 2022 Elsevier 
\section{Reviewing}
\label{sec-4}
\begin{itemize}
\item Jeg  er reviewer for en spesial utgave 
om språk for aktive objekter, publisert av Springer.
\item Jeg er blitt med i PC komiteen for Modelsward 2024.
\end{itemize}

\section{Oversikt over videre PhD veiledning:}
\label{sec-5}

\begin{itemize}
\item Farzane Karami  (hovedveileder) disputas forventes i sept/okt  2023
\item Marius Geitle  (hovedveileder) forventes ferdig i 2023/2024
\item Chinmayi Prabhu Prasad Baramashetru  (medveileder) forventes ferdig
i slutten av 2024
\end{itemize}

\section{Prosjektarbeid}
\label{sec-6}
\begin{itemize}
\item Jeg er med på PriTEM prosjektet
\end{itemize}

\begin{itemize}
\item Jeg er involvert i et prosjekt med AtomIQ AS sammen med UiO Blockchain Lab.

\item Jeg har hatt kontakt med miljøer ved 
ITS, SINTEF, NR, Prosa AS, og Nvidia (Tyskland)
om mulige fremtidige prosjekter.
\end{itemize}

\section{Annet}
\label{sec-7}
\begin{itemize}
\item Jeg er med i styret av BlockChain Lab ved IfI
\end{itemize}
\url{https://www.mn.uio.no/ifi/english/research/networks/blockchainlab/}


\begin{itemize}
\item Jeg  har  holdt et  foredrag om smarte kontrakter
ved en workshop med Norges Bank i regi av BlockChain Lab.
\end{itemize}
% Emacs 26.1 (Org mode 8.2.5h)
\end{document}
